[
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/1.1---Poisonous-Families-VS-Heroic-Families.aspx", 
    "title": "1.1 - Poisonous Families VS Heroic Families", 
    "description": "Transcript Let's talk about the differences between a poisonous family and a heroic family. Let's start with the poisonous. Poisonous family will slow you down. It creates confusion in the team. It looks weird or ugly. It makes the model larger and …"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Autodesk-Revit-Content-Catalog-User-Guide.aspx", 
    "title": "Autodesk Revit Content Catalog User Guide", 
    "description": "Introduction The Revit Content Catalog is a powerful repository for managing, and accessing Revit content such as families, detail items, and drafting views. This guide will walk you through how to effectively use the Content Catalog to enhance your…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/BBB---Barn-Door---Double.aspx", 
    "title": "BBB - Barn Door - Double", 
    "description": "Overview This double barn door family template provides a foundation for creating pairs of sliding doors mounted on external tracks. The default size is set to 6'-0\" x 8'-0\", with each leaf being 3'-0\" wide. No pre-configured types are included – us…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/BBB-Barn-Door-Single.aspx", 
    "title": "BBB - Barn Door - Single", 
    "description": "Overview This barn door family template provides a foundation for creating sliding doors mounted on external tracks. The default size is set to 3'-0\" x 8'-0\". No pre-configured types are included – users should create these based on project requirem…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/BBB-Door-Double.aspx", 
    "title": "BBB - Door - Double", 
    "description": "Overview This double door family template provides a flexible foundation for creating pairs of doors with configurable dimensions and hardware. The default size is set to 6'-0\" x 7'-0\", with each leaf being 3'-0\" wide. No pre-configured types are in…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/BBB-Door-Families.aspx", 
    "title": "Door Families", 
    "description": "BBB's standard template includes a core set of door families designed to handle common project needs. These templated families provide a foundation for creating project-specific door types while maintaining consistent standards across projects. Prel…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/BBB-Door-Single.aspx", 
    "title": "BBB - Door - Single", 
    "description": "Overview This door family template provides a flexible foundation for creating a single door family with configurable dimensions, hardware, and clearance requirements. The default size is set to 3'-0\" x 7'-0\", though no pre-configured types are incl…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/BBB-Opening.aspx", 
    "title": "BBB - Opening", 
    "description": "Overview This cased opening template provides a simple foundation for creating wall openings with optional trim. The default size is set to 3'-0\" x 7'-0\". No pre-configured types are included – users should create these based on project requirements…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/BBB---Pocket-Door---Double.aspx", 
    "title": "BBB - Pocket Door - Double", 
    "description": "Overview This double pocket door family template provides a foundation for creating pairs of pocket doors internally mounted within the depth of a partition. The default size is set to 6'-0\" x 8'-0\", with each leaf being 3'-0\" wide. No pre-configure…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/BBB---Pocket-Door---Single.aspx", 
    "title": "BBB - Pocket Door - Single", 
    "description": "Overview This pocket door family template provides a foundation for creating pocket doors recessed within a partition. The default size is set to 3'-0\" x 7'-0\". No pre-configured types are included – users should create these based on project requir…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/BIM-Automations.aspx", 
    "title": "BIM Automations", 
    "description": "Introduction DCT offers a range of automation services to streamline Revit tasks and improve project efficiency. Signing a project up for model automations can be done via this form. Below is an outline of the services available and the information …"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Building-Great-Families.aspx", 
    "title": "Revit Family Essentials Training", 
    "description": "Revit Family Essentials Training Solid Revit families are foundational to effective BIM practice. These training videos from BIM Pure cover everything from family fundamentals and parametric techniques through advanced topics like adaptive component…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Clearing-Your-Collaboration-Cache.aspx", 
    "title": "Clearing Your Collaboration Cache", 
    "description": "Consider regularly clearing your temporary cache files to improve Revit model stability / performance. Generally, this is good practice every other month or when your model has a critical error or crashes. This process will delete your local file(s)…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Dimension-Styles.aspx", 
    "title": "Dimension Styles", 
    "description": "Overview BBB's Revit template includes pre-loaded standard dimension styles to ensure consistent documentation across all projects. These styles are categorized by measurement type and have specific use cases for different documentation needs. Dimen…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Fill-Patterns.aspx", 
    "title": "Fill Regions", 
    "description": "Introduction The BBB Revit template includes 116 standard fill patterns designed for consistent use across projects. Each pattern follows a structured naming convention that must be applied when creating new patterns. Key Points: Material-specific h…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Graphic-Standards.aspx", 
    "title": "Graphic Standards Overview", 
    "description": "Clear, consistent graphics aren’t just about aesthetics, they’re essential for efficient collaboration and communication across all BBB projects. These standards define how we use key visual elements in Revit to ensure our drawings remain profession…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Home.aspx", 
    "title": "Home", 
    "description": "Welcome to the BBB Revit Standards manual! Having consistent standards and naming conventions is key to creating a smooth workflow across all of BBB's projects. The standards you'll find here help everyone work efficiently and flexibly in Revit whil…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Line-Patterns.aspx", 
    "title": "Line Patterns", 
    "description": "BBB uses standardized line patterns across all projects to ensure uniformity and improve drawing readability. This guide outlines approved patterns, their typical uses, and implementation best practices. Line Pattern Description Common Uses Solid A …"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Line-Styles.aspx", 
    "title": "Line Styles", 
    "description": "Overview The BBB Revit template includes a comprehensive set of Line Styles for all drafting needs. Consistent use of these styles ensures uniformity across projects. These can be divided into 3 main groups, Core Styles, Use-Specific Styles, and Sys…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Line-Weight-Guidelines.aspx", 
    "title": "Line Weight Guidelines", 
    "description": "Black Lines (Weights 1 - 5) Weight Usage 1 (Detail Lines) Dimension lines and text Light construction lines / fine details Hatch patterns Ceiling grid lines Annotation lines (leaders, callout bubbles) 2 (Light Lines) Items in immediate elevation Cut…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Model-Setup.aspx", 
    "title": "Project Setup", 
    "description": "All BBB Revit models should be derived from the BBB Revit template file, which includes the default graphic styles, families, and shared parameters. To create a new project, a project team member should: Download the template file from the link. Ren…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Parameter-Names.aspx", 
    "title": "Parameters", 
    "description": "Overview Revit parameters are essential components that control element properties and behaviors within projects and families. Understanding the different types of parameters and their appropriate usage is crucial for efficient project management an…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Parameter-Naming.aspx", 
    "title": "Parameter Naming", 
    "description": "Naming Convention: [Special Prefix]_[Category]_[Property][_Suffix] Special Prefix S_ : Shared parameters Is_/Has_ : Boolean Parameters Family Parameters have no prefix Category (Optional) Use for specific sub-elements in a family (e.g., Jamb_, Head_…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/PDSO.aspx", 
    "title": "Program Data Silo Objects (PDSO) Workflows", 
    "description": "What is it? The Program Data Silo Object (PDSO) is a custom Revit workflow that creates a federated source of truth for spatial program data. Instead of spreading unit information across multiple area schemes and schedules, PDSO consolidates everyth…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Point-Cloud-Tools.aspx", 
    "title": "Point Cloud Tools", 
    "description": "What is it? Point Cloud Tools is a custom workflow for recording and restoring the exact coordinates of point clouds in your Revit models. The tools ensure your point clouds stay in the correct location when reloading links, migrating to new models,…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Project-Browser-Organization.aspx", 
    "title": "Project Browser Organization", 
    "description": "Overview The BBB Revit Template provides structured organization for views and sheets in the Project Browser. The organization system is designed to maintain consistency across projects and improve navigation efficiency. Default View Organization Wh…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/PyRevit.aspx", 
    "title": "pyRevit", 
    "description": "PyRevit is an add-in for Autodesk Revit that provides a comprehensive collection of productivity tools right out of the box. It adds a new ribbon to Revit packed with helpful features like batch sheet printing, view duplicating, selection tools, par…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Revit-Cloud-Model-Version-Upgrade.aspx", 
    "title": "Revit Model Upgrade Process", 
    "description": "DCT strongly recommends upgrading Revit projects to the version matching the current calendar year once they are more than 3 releases old. DCT's recommended upgrade process leverages Autodesk's Construction Cloud (ACC) service for upgrades. This pro…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Revit-Model-Upgrade-Policy.aspx", 
    "title": "Revit Model Upgrade Policy", 
    "description": "DCT policy requires upgrading all models to the latest version once they're more than two years old. This ensures full Autodesk support throughout the project lifecycle and helps maintain model stability. We've set up an automated process that monit…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Revit-Standards-Feedback-Form.aspx", 
    "title": "Revit Standards Feedback Form", 
    "description": null
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Shared-Parameter-File.aspx", 
    "title": "Shared Parameter File", 
    "description": "Template File Location N:\\Design Technology Resources\\01_BIM CONTENT\\BBB Shared Parameters.txt Important Notes The .TXT file titled \"BB Shared Parameters\" contains system-generated GUIDs for each Shared Parameter. These GUIDs are unique and impossib…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Shared-Parameters.aspx", 
    "title": "Shared Parameters", 
    "description": "Overview The firmwide Revit template contains necessary Shared Parameters and Project Parameters for core functionality. These custom parameters should NOT be edited or removed without thorough understanding by a qualified BIM Manager. Best Practice…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Standard-Shared-Parameters.aspx", 
    "title": "Standard Shared Parameters", 
    "description": "Parameter Category Parameter Name Use Sheet Parameters S_Sheet_Name S_Sheet_Drawing Number S_Sheet_Phase S_Sheet_Is For_Permitting S_Sheet_Is For_Construction S_Sheet_DOB Filing Number S_Sheet_Package S_Sheet_Sheet Numbers S_Sheet_Total Sheets Speci…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Suggesting-Changes-to-the-BBB-Template.aspx", 
    "title": "Suggesting Updates or Changes to The Template", 
    "description": "We value input from all team members to keep our standards current and effective. To suggest updates or changes: Document Your Suggestion : Clearly describe the proposed change, including: Specific section or item to be updated Rationale for the cha…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Template-Line-Types.aspx", 
    "title": "Template Line Types", 
    "description": "Line Type Line Weight Color Color Code Pattern Comment 1 - Solid 1 Black ■ Black Solid Typical Drafting 2 - Solid 3 Black ■ Black Solid Typical Drafting 3 - Solid 5 Black ■ Black Solid Typical Drafting 4 - Solid 7 Black ■ Black Solid Typical Draftin…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Text-Styles.aspx", 
    "title": "Text Styles", 
    "description": "Overview BBB documents use Arial Narrow as the standard font. To maintain consistency across all BBB documentation, adhere to the standard document text styles provided in the template. Avoid importing additional fonts or creating new text styles un…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/The-BBB-Revit-Toolbar.aspx", 
    "title": "The BBB Revit Toolbar", 
    "description": "The BBB Revit Toolbar adds custom BBB-designed tools to Revit to help you manage your data, wrangle your point clouds, and quickly link you to the latest standards and support. Developed specifically for BBB workflows, this toolbar streamlines commo…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Titleblocks.aspx", 
    "title": "Title Blocks", 
    "description": "The BBB Revit template comes with a selection of title blocks as outlined in the table opposite. These may be modified to suit particular project needs, or jurisdictional requirements. Copies of these can be found here. Standard Size Variations ANSI…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Training-and-Guidance.aspx", 
    "title": "Guidance and Training", 
    "description": "Training Courses How to Build Great Families BBB Core Tech Classes In-depth training videos organized by topic Quick Revit Guides Fundamentals Families Phases Part I Phases Part II Reference Planes Worksets Groups Part I Groups Part II In this secti…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/View-Filters.aspx", 
    "title": "View Filter Naming Convention", 
    "description": "Basic Format [Category Being Filtered] - [Property Being Filtered For] - (Isolate) Components Breakdown 1. Category Being Filtered Use the Revit category name (e.g., Walls, Windows, Views) For multi-category filters, separate categories with '+' 2. …"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/View-Templates.aspx", 
    "title": "View Templates", 
    "description": "Overview The BBB Revit template includes pre-configured View Templates designed to work seamlessly with View Types and Browser Organization for efficient project management. Best Practices Use existing View Templates whenever possible. If creating a…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/View-Types.aspx", 
    "title": "View Types", 
    "description": "Introduction BBB's Revit template includes customized view types for Plans, Sections, Elevations, and Callouts. These view types are designed to work in conjunction with View Templates and are integrated with browser organization and sorting systems…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Wall-Types.aspx", 
    "title": "Wall Types", 
    "description": "BBB uses a standardized naming convention for wall types in Revit to allow for quick identification of wall characteristics based on a type mark and description. These wall types are outlined on the template partition types sheet A-700 and A-701. Ty…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Wall-Types---1.aspx", 
    "title": "Wall Types - Revised", 
    "description": "BBB uses a standardized naming convention for wall types in Revit to allow for quick identification of wall characteristics based on a type mark and description. These wall types are outlined on the template partition types sheet A-700 and A-701. Ty…"
  }, 
  {
    "url": "https://beyerblinderbelle.sharepoint.com/sites/revitstandards/SitePages/Worksets(1).aspx", 
    "title": "Workset Management Standards", 
    "description": "1. Workset Naming Conventions Purpose Consistent workset naming and organization is essential for efficient collaboration, model performance, and file management. This page defines our firm's standard workset organization strategy, naming convention…"
  }
]